{
  "right shoulder": {
    "pain_points": [
      "Soreness on top of shoulder",
      "Ache during overhead motion",
      "Mild stiffness after swimming"
    ],
    "pain_level": "5",
    "warnings": [
      "If you experience sharp or worsening pain during any movement, stop immediately and rest.",
      "If pain persists beyond 7 days or you notice decreased strength or range of motion, consult a healthcare professional.",
      "If you develop numbness, tingling, or a sensation of instability in the arm, seek prompt medical evaluation."
    ],
    "exercises": [
      "Pendulum Swings: Lean forward with your non-painful arm supported on a table. Let the painful arm hang and gently swing it in small circles for 1–2 minutes.",
      "Resisted External Rotation: Attach a light resistance band at waist height. With elbow bent 90° and tucked at your side, rotate your forearm outward. Do 2–3 sets of 10–15 reps.",
      "Cross-Body Stretch: Bring the painful arm across your chest and use the opposite hand to pull it closer. Hold for 20–30 seconds, repeat 3 times.",
      "Doorway Pec Stretch: Stand in a doorway with elbow and shoulder at 90°. Place your forearm on the frame and gently lean forward until you feel a stretch in the front shoulder/chest. Hold 20–30 seconds, repeat 3 times.",
      "Scapular Retraction (Wall Angels): Stand with your back against a wall, arms in a “W” shape. Slide your arms upward into a “Y,” keeping wrists and elbows in contact with the wall. Perform 2–3 sets of 8–12 reps."
    ]
  },
  "left thigh": {
    "pain_points": [
      "dull ache along the quadriceps",
      "discomfort with bending or walking"
    ],
    "pain_level": "5",
    "warnings": [
      "If you experience significant swelling, bruising, or inability to bear weight, seek medical attention.",
      "If pain worsens or persists beyond 5–7 days, consult a healthcare professional.",
      "If you develop numbness, tingling, or severe weakness in the leg, seek prompt evaluation."
    ],
    "exercises": [
      "Standing Quadriceps Stretch: Stand on one leg, pull your opposite heel toward your glutes, keeping knees close. Hold 20–30 seconds, repeat 3 times.",
      "Hamstring Stretch: Lie on your back, loop a towel around your foot and straighten your leg overhead until you feel a stretch. Hold 20–30 seconds, repeat 3 times.",
      "Straight Leg Raises: Lie on your back with one knee bent and the other straight. Lift the straight leg to hip height, hold 2 seconds, then lower slowly. Perform 2–3 sets of 10–15 reps.",
      "Glute Bridge: Lie on your back with knees bent and feet flat. Lift hips until your body forms a straight line, squeeze glutes, hold 2–3 seconds, then lower. Perform 2–3 sets of 10–12 reps.",
      "Foam Roller Quadriceps Massage: Lie face down, place a foam roller under your thigh, and roll gently from hip to knee for 1–2 minutes."
    ]
  },
  "right thigh": {
    "pain_points": [
      "mild to moderate soreness on the front of the thigh",
      "tenderness when contracting the quadriceps (knee extension)",
      "muscle fatigue or cramping during activities such as kicking or walking"
    ],
    "pain_level": "4",
    "warnings": [
      "If you notice significant swelling, bruising, or cannot bear weight, seek medical attention immediately.",
      "If pain worsens or does not improve after 5–7 days of rest and self-care, consult a healthcare professional.",
      "If you develop numbness, tingling, or severe weakness in the leg, seek prompt evaluation."
    ],
    "exercises": [
      "Standing Quadriceps Stretch: Stand on one leg, pull the opposite heel toward your glutes, keeping knees close. Hold 20–30 seconds, repeat 3 times per side.",
      "Foam Roller Quadriceps Massage: Lie face down, place a foam roller under your right thigh, and roll gently from hip to knee for 1–2 minutes.",
      "Straight Leg Raises: Lie on your back with one knee bent and the other leg straight. Lift the straight leg to hip height, hold for 2 seconds, then lower slowly. Perform 2–3 sets of 10–15 reps.",
      "Prone Hip Flexor Stretch: Lie face down, prop on forearms, gently squeeze your right glute to tilt the pelvis and stretch the front of your thigh. Hold 20–30 seconds, repeat 3 times.",
      "Bodyweight Squats (Pain-Free Range): Stand feet hip-width apart, squat only as far as you can without pain, then return to standing. Perform 2–3 sets of 10–12 reps."
    ]
  },
  "HISTORY": {},
  "left chest": {
    "pain_points": [
      "dull to sharp pain in left pectoral region during breaststroke pull",
      "aching or tightness after swimming",
      "pain aggravated by pressing arms together or reaching across chest"
    ],
    "pain_level": "5",
    "warnings": [
      "If you experience chest pain with shortness of breath, sweating, dizziness or nausea, seek emergency care immediately.",
      "If pain is sharp, severe, or associated with bruising or swelling of the chest, stop activity and see a healthcare professional.",
      "If discomfort persists beyond 7 days despite rest and self-care, consult a physical therapist or physician."
    ],
    "exercises": [
      "Doorway Pec Stretch: Stand in a doorway, place forearm on frame at shoulder height, lean forward until you feel a gentle stretch in the front of your chest. Hold 20–30 seconds, repeat 3 times each side.",
      "Foam Roller Chest Opener: Lie face-up on a foam roller placed lengthwise along your spine, let arms fall out to sides, palms up. Breathe deeply for 1–2 minutes.",
      "Isometric Adduction Press: Stand or sit, press your palms together in front of your sternum at shoulder height, hold 5 seconds, relax. Repeat 10 times.",
      "Scapular Retraction: Sit or stand tall, squeeze shoulder blades together as if pinching a pencil between them, hold 5 seconds, release. Repeat 10–15 times.",
      "Cross-Body Shoulder Stretch: Bring your left arm across your chest and use your right hand to gently pull it closer. Hold 20–30 seconds, repeat 3 times."
    ]
  },
  "left calf": {
    "pain_points": [
      "severe pain in the left calf"
    ],
    "pain_level": "7",
    "warnings": [
      "If you experience sudden swelling, redness, warmth, or develop fever in the calf, seek medical evaluation to rule out deep vein thrombosis.",
      "If you hear a popping sound at any point, cannot bear weight, or notice bruising, seek immediate medical attention."
    ],
    "exercises": [
      "Gastrocnemius Stretch: Stand facing a wall, place both hands on it, step the affected leg back with knee straight and heel on the floor. Lean forward until you feel a stretch in the upper calf. Hold 20-30 seconds, repeat 3 times.",
      "Soleus Stretch: From the same position, slightly bend the back knee while keeping heel down. Lean forward to target the lower calf. Hold 20-30 seconds, repeat 3 times.",
      "Eccentric Calf Raises: Stand on a step or sturdy block with heels off the edge. Rise up onto both toes, transfer weight to the affected leg, then slowly lower the heel below step level over 3-4 seconds. Perform 2-3 sets of 10-12 reps.",
      "Single-Leg Balance: Stand barefoot on the affected leg, keeping a slight bend in the knee. Hold for 30 seconds, focus on even weight distribution. Repeat 2-3 times.",
      "Foam Roller Massage: Sit with foam roller under the calf. Gently roll from just below the knee to just above the ankle for 1-2 minutes, pausing on any tender spots."
    ]
  },
  "left shoulder": {
    "pain_points": [],
    "pain_level": "1",
    "warnings": [
      "Maintain awareness for any return of pain or new symptoms. Engage in gentle stretches and strengthening exercises to prevent future discomfort. If any acute pain, swelling, or sudden limitation in range of motion reoccurs, seek medical advice."
    ],
    "exercises": [
      "Pendulum Swings: Lean forward, support your other arm on a table, let your arm hang, and gently swing in small circles for 1\u00132 minutes once a day.",
      "Scapular Retraction (Wall Angels): Stand with back and arms against a wall in a 'W' shape. Slide arms up into a 'Y,' keeping contact with the wall. Perform 2-3 sets of 8-12 reps to maintain shoulder mobility and strength.",
      "Resisted External Rotation: Secure a light resistance band at waist height. With elbow bent 90\u00067 at your side, rotate your forearm outward. Do 2\u00143 sets of 10\u001415 reps.",
      "Doorway Pec Stretch: Place your forearm on a doorframe at shoulder height and gently lean forward until you feel a stretch in the front of your shoulder/chest. Hold 20-30 seconds, repeat 3 times.",
      "Pain-Free Shoulder Elevations: Slowly lift your arms forward (flexion) and to the side (abduction) only as far as comfortable. Perform 2\u00143 sets of 10\u001415 reps each to ensure shoulder function remains optimal."
    ]
  }
}